## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/10035709624)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 38 to add, 18 to change, 2 to destroy.</code></pre>

* Create
  * google_service_account.control-plane
  * google_service_account.counduit-cli-bucket
  * google_service_account.firebase-adminsdk-udzxq
  * google_service_account.gcr-cleaner
  * google_service_account.gcs-bucket-mover
  * google_service_account.gencred-refresher
  * google_service_account.github-issue-creator
  * google_service_account.github-issue-finder
  * google_service_account.github-webhook-gateway
  * google_service_account.gitleaks-secret-accesor
  * google_service_account.kyma-oci-image-builder
  * google_service_account.sa-dev-kyma-project
  * google_service_account.sa-gardener-logs
  * google_service_account.sa-gcr-kyma-project-trusted
  * google_service_account.sa-gcs-plank
  * google_service_account.sa-gke-kyma-integration
  * google_service_account.sa-keys-cleaner
  * google_service_account.sa-keys-rotator
  * google_service_account.sa-kyma-artifacts
  * google_service_account.sa-kyma-dns-serviceuser
  * google_service_account.sa-kyma-project
  * google_service_account.sa-prow-deploy
  * google_service_account.sa-prow-job-resource-cleaners
  * google_service_account.sa-prow-pubsub
  * google_service_account.sa-prowjob-gcp-logging-client
  * google_service_account.sa-secret-update
  * google_service_account.sa-security-dashboard-oauth
  * google_service_account.sa-vm-kyma-integration
  * google_service_account.secret-manager-prow
  * google_service_account.secret-manager-trusted
  * google_service_account.secret-manager-untrusted
  * google_service_account.secrets-leak-detector
  * google_service_account.secrets-leak-log-scanner
  * google_service_account.slack-message-sender
  * google_service_account.terraform-executor
  * google_service_account.terraform-planner
* Update
  * google_service_account.sa_gke_kyma_integration
  * google_service_account.secrets-rotator
  * module.cors_proxy.google_cloud_run_service.cors_proxy
  * module.github_webhook_gateway.google_service_account.github_webhook_gateway
  * module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.gcs_bucket_mover
  * module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.github_issue_creator
  * module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.github_issue_finder
  * module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.secrets_leak_log_scanner
  * module.secrets_leaks_log_scanner.google_service_account.gcs_bucket_mover
  * module.secrets_leaks_log_scanner.google_service_account.github_issue_creator
  * module.secrets_leaks_log_scanner.google_service_account.github_issue_finder
  * module.secrets_leaks_log_scanner.google_service_account.secrets_leak_detector
  * module.secrets_leaks_log_scanner.google_service_account.secrets_leak_log_scanner
  * module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner
  * module.service_account_keys_cleaner.google_service_account.service_account_keys_cleaner
  * module.service_account_keys_rotator.google_service_account.service_account_keys_rotator
  * module.slack_message_sender.google_cloud_run_service_iam_policy.slack_message_sender
  * module.slack_message_sender.google_service_account.slack_message_sender
* Replace
  * module.secrets_leaks_log_scanner.google_project_iam_member.project_log_writer
  * module.secrets_leaks_log_scanner.google_project_iam_member.project_workflows_invoker



<details><summary>Change Result (Click me)</summary>

```hcl

  # google_service_account.control-plane will be created
  + resource "google_service_account" "control-plane" {
      + account_id                   = "control-plane"
      + create_ignore_already_exists = true
      + description                  = "Main prow components SA Will be removed with Prow"
      + disabled                     = false
      + display_name                 = "control-plane"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.counduit-cli-bucket will be created
  + resource "google_service_account" "counduit-cli-bucket" {
      + account_id                   = "counduit-cli-bucket"
      + create_ignore_already_exists = true
      + description                  = "SA to push/pull conduit-cli"
      + disabled                     = false
      + display_name                 = "counduit-cli-bucket"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.firebase-adminsdk-udzxq will be created
  + resource "google_service_account" "firebase-adminsdk-udzxq" {
      + account_id                   = "firebase-adminsdk-udzxq"
      + create_ignore_already_exists = true
      + description                  = "Firebase Admin SDK Service Agent"
      + disabled                     = false
      + display_name                 = "firebase-adminsdk"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.gcr-cleaner will be created
  + resource "google_service_account" "gcr-cleaner" {
      + account_id                   = "gcr-cleaner"
      + create_ignore_already_exists = true
      + description                  = "Service account is used by gcr-cleaner tool."
      + disabled                     = false
      + display_name                 = "gcr-cleaner"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.gcs-bucket-mover will be created
  + resource "google_service_account" "gcs-bucket-mover" {
      + account_id                   = "gcs-bucket-mover"
      + create_ignore_already_exists = true
      + description                  = "Identity of cloud run instance running gcs bucket mover service."
      + disabled                     = false
      + display_name                 = "gcs-bucket-mover"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.gencred-refresher will be created
  + resource "google_service_account" "gencred-refresher" {
      + account_id                   = "gencred-refresher"
      + create_ignore_already_exists = true
      + description                  = "Service Account used to automatically refresh kubeconfigs for workload cluster on Prow using ProwJob `ci-gencred-refresh-kubeconfig` Will be removed with Prow"
      + disabled                     = false
      + display_name                 = "gencred-refresher"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.github-issue-creator will be created
  + resource "google_service_account" "github-issue-creator" {
      + account_id                   = "github-issue-creator"
      + create_ignore_already_exists = true
      + description                  = "Identity of cloud run instance running github issue creator service."
      + disabled                     = false
      + display_name                 = "github-issue-creator"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.github-issue-finder will be created
  + resource "google_service_account" "github-issue-finder" {
      + account_id                   = "github-issue-finder"
      + create_ignore_already_exists = true
      + description                  = "Identity of cloud run instance running github issue finder service."
      + disabled                     = false
      + display_name                 = "github-issue-finder"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.github-webhook-gateway will be created
  + resource "google_service_account" "github-webhook-gateway" {
      + account_id                   = "github-webhook-gateway"
      + create_ignore_already_exists = true
      + description                  = "Identity of cloud run instance running github webhook gateway service."
      + disabled                     = false
      + display_name                 = "github-webhook-gateway"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.gitleaks-secret-accesor will be created
  + resource "google_service_account" "gitleaks-secret-accesor" {
      + account_id                   = "gitleaks-secret-accesor"
      + create_ignore_already_exists = true
      + description                  = "Identity of gitleaks. It's used to retrieve secrets from secret manager"
      + disabled                     = false
      + display_name                 = "gitleaks-secret-accesor"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.kyma-oci-image-builder will be created
  + resource "google_service_account" "kyma-oci-image-builder" {
      + account_id                   = "kyma-oci-image-builder"
      + create_ignore_already_exists = true
      + description                  = "Service Account for retrieving secrets on the oci-image-builder ADO pipeline."
      + disabled                     = false
      + display_name                 = "kyma-oci-image-builder"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.sa-dev-kyma-project will be created
  + resource "google_service_account" "sa-dev-kyma-project" {
      + account_id                   = "sa-dev-kyma-project"
      + create_ignore_already_exists = true
      + description                  = "SA to manage DEV Artifact Registry in SAP CX Kyma Project"
      + disabled                     = false
      + display_name                 = "sa-dev-kyma-project"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.sa-gardener-logs will be created
  + resource "google_service_account" "sa-gardener-logs" {
      + account_id                   = "sa-gardener-logs"
      + create_ignore_already_exists = true
      + description                  = "SA used by gardener cluster to send logs to Stackdriver. Will be removed with Prow"
      + disabled                     = false
      + display_name                 = "sa-gardener-logs"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.sa-gcr-kyma-project-trusted will be created
  + resource "google_service_account" "sa-gcr-kyma-project-trusted" {
      + account_id                   = "sa-gcr-kyma-project-trusted"
      + create_ignore_already_exists = true
      + description                  = "Access to GCR in kyma-project and KMS key in kyma-prow. Will be removed with Prow"
      + disabled                     = false
      + display_name                 = "sa-gcr-kyma-project-trusted"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.sa-gcs-plank will be created
  + resource "google_service_account" "sa-gcs-plank" {
      + account_id                   = "sa-gcs-plank"
      + create_ignore_already_exists = true
      + description                  = "The `plank` component schedules the pod requested by a prowjob. Will be removed with Prow"
      + disabled                     = false
      + display_name                 = "sa-gcs-plank"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.sa-gke-kyma-integration will be created
  + resource "google_service_account" "sa-gke-kyma-integration" {
      + account_id                   = "sa-gke-kyma-integration"
      + create_ignore_already_exists = true
      + description                  = "Service account is used by Prow to integrate with GKE. Will be removed with Prow"
      + disabled                     = false
      + display_name                 = "sa-gke-kyma-integration"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.sa-keys-cleaner will be created
  + resource "google_service_account" "sa-keys-cleaner" {
      + account_id                   = "sa-keys-cleaner"
      + create_ignore_already_exists = true
      + description                  = "Identity of the service account keys rotator service."
      + disabled                     = false
      + display_name                 = "sa-keys-cleaner"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.sa-keys-rotator will be created
  + resource "google_service_account" "sa-keys-rotator" {
      + account_id                   = "sa-keys-rotator"
      + create_ignore_already_exists = true
      + description                  = "Identity of the service account keys rotator service."
      + disabled                     = false
      + display_name                 = "sa-keys-rotator"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.sa-kyma-artifacts will be created
  + resource "google_service_account" "sa-kyma-artifacts" {
      + account_id                   = "sa-kyma-artifacts"
      + create_ignore_already_exists = true
      + description                  = "Service account used by ProwJob kyma-artifacts. Will be removed with Prow"
      + disabled                     = false
      + display_name                 = "sa-kyma-artifacts"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.sa-kyma-dns-serviceuser will be created
  + resource "google_service_account" "sa-kyma-dns-serviceuser" {
      + account_id                   = "sa-kyma-dns-serviceuser"
      + create_ignore_already_exists = true
      + description                  = "<Used by api-gateway> Service Account used to manipulate DNS entries in sap-kyma-prow-workloads. Will be removed with Prow"
      + disabled                     = false
      + display_name                 = "sa-kyma-dns-serviceuser"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.sa-kyma-project will be created
  + resource "google_service_account" "sa-kyma-project" {
      + account_id                   = "sa-kyma-project"
      + create_ignore_already_exists = true
      + description                  = "SA to manage PROD Artifact Registry in SAP CX Kyma Project"
      + disabled                     = false
      + display_name                 = "sa-kyma-project"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.sa-prow-deploy will be created
  + resource "google_service_account" "sa-prow-deploy" {
      + account_id                   = "sa-prow-deploy"
      + create_ignore_already_exists = true
      + description                  = "SA with admin rights in Prow cluster Will be removed with Prow"
      + disabled                     = false
      + display_name                 = "sa-prow-deploy"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.sa-prow-job-resource-cleaners will be created
  + resource "google_service_account" "sa-prow-job-resource-cleaners" {
      + account_id                   = "sa-prow-job-resource-cleaners"
      + create_ignore_already_exists = true
      + description                  = "SA used by multiple resource cleaner prowjobs. Will be removed with Prow"
      + disabled                     = false
      + display_name                 = "sa-prow-job-resource-cleaners"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.sa-prow-pubsub will be created
  + resource "google_service_account" "sa-prow-pubsub" {
      + account_id                   = "sa-prow-pubsub"
      + create_ignore_already_exists = true
      + description                  = "Run prow related pubsub topics, subscriptions and cloud functions. Will be removed with Prow"
      + disabled                     = false
      + display_name                 = "sa-prow-pubsub"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.sa-prowjob-gcp-logging-client will be created
  + resource "google_service_account" "sa-prowjob-gcp-logging-client" {
      + account_id                   = "sa-prowjob-gcp-logging-client"
      + create_ignore_already_exists = true
      + description                  = "Read, write access to google cloud logging for prowjobs. Will be removed with Prow"
      + disabled                     = false
      + display_name                 = "sa-prowjob-gcp-logging-client"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.sa-secret-update will be created
  + resource "google_service_account" "sa-secret-update" {
      + account_id                   = "sa-secret-update"
      + create_ignore_already_exists = true
      + description                  = "Can update secrets in Secret Manager"
      + disabled                     = false
      + display_name                 = "sa-secret-update"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.sa-security-dashboard-oauth will be created
  + resource "google_service_account" "sa-security-dashboard-oauth" {
      + account_id                   = "sa-security-dashboard-oauth"
      + create_ignore_already_exists = true
      + description                  = "Used for the Security dashboard cloud run"
      + disabled                     = false
      + display_name                 = "sa-security-dashboard-oauth"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.sa-vm-kyma-integration will be created
  + resource "google_service_account" "sa-vm-kyma-integration" {
      + account_id                   = "sa-vm-kyma-integration"
      + create_ignore_already_exists = true
      + description                  = "Will be removed with Prow"
      + disabled                     = false
      + display_name                 = "sa-vm-kyma-integration"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.sa_gke_kyma_integration will be updated in-place
  ~ resource "google_service_account" "sa_gke_kyma_integration" {
      ~ description  = "Service account is used by Prow to integrate with GKE. Will be removed with Prow" -> "Service account is used by Prow to integrate with GKE."
        id           = "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # google_service_account.secret-manager-prow will be created
  + resource "google_service_account" "secret-manager-prow" {
      + account_id                   = "secret-manager-prow"
      + create_ignore_already_exists = true
      + description                  = "Will be removed with Prow"
      + disabled                     = false
      + display_name                 = "secret-manager-prow"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.secret-manager-trusted will be created
  + resource "google_service_account" "secret-manager-trusted" {
      + account_id                   = "secret-manager-trusted"
      + create_ignore_already_exists = true
      + description                  = "Will be removed with Prow"
      + disabled                     = false
      + display_name                 = "secret-manager-trusted"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.secret-manager-untrusted will be created
  + resource "google_service_account" "secret-manager-untrusted" {
      + account_id                   = "secret-manager-untrusted"
      + create_ignore_already_exists = true
      + description                  = "Will be deleted with Prow"
      + disabled                     = false
      + display_name                 = "secret-manager-untrusted"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.secrets-leak-detector will be created
  + resource "google_service_account" "secrets-leak-detector" {
      + account_id                   = "secrets-leak-detector"
      + create_ignore_already_exists = true
      + description                  = "Identity of secrets leak detector application."
      + disabled                     = false
      + display_name                 = "secrets-leak-detector"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.secrets-leak-log-scanner will be created
  + resource "google_service_account" "secrets-leak-log-scanner" {
      + account_id                   = "secrets-leak-log-scanner"
      + create_ignore_already_exists = true
      + description                  = "Identity of cloud run instance running log scanner service."
      + disabled                     = false
      + display_name                 = "secrets-leak-log-scanner"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.secrets-rotator will be updated in-place
  ~ resource "google_service_account" "secrets-rotator" {
      + create_ignore_already_exists = true
        id                           = "projects/sap-kyma-prow/serviceAccounts/secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com"
        name                         = "projects/sap-kyma-prow/serviceAccounts/secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com"
        # (8 unchanged attributes hidden)
    }

  # google_service_account.slack-message-sender will be created
  + resource "google_service_account" "slack-message-sender" {
      + account_id                   = "slack-message-sender"
      + create_ignore_already_exists = true
      + description                  = "Identity of cloud run instance running slack message sender service."
      + disabled                     = false
      + display_name                 = "slack-message-sender"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.terraform-executor will be created
  + resource "google_service_account" "terraform-executor" {
      + account_id                   = "terraform-executor"
      + create_ignore_already_exists = true
      + description                  = "Identity of terraform executor. It's mapped to k8s service account through workload identity."
      + disabled                     = false
      + display_name                 = "terraform-executor"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # google_service_account.terraform-planner will be created
  + resource "google_service_account" "terraform-planner" {
      + account_id                   = "terraform-planner"
      + create_ignore_already_exists = true
      + description                  = "Identity of terraform planner"
      + disabled                     = false
      + display_name                 = "terraform-planner"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "sap-kyma-prow"
      + unique_id                    = (known after apply)
    }

  # module.cors_proxy.google_cloud_run_service.cors_proxy will be updated in-place
  ~ resource "google_cloud_run_service" "cors_proxy" {
        id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/cors-proxy"
        name                       = "cors-proxy"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/cors-proxy:v20240719-49542d2d" -> "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/cors-proxy:v20240719-fe138649"
                    # (2 unchanged attributes hidden)

                    # (6 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.github_webhook_gateway.google_service_account.github_webhook_gateway will be updated in-place
  ~ resource "google_service_account" "github_webhook_gateway" {
      - display_name = "github-webhook-gateway" -> null
        id           = "projects/sap-kyma-prow/serviceAccounts/github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.data.google_iam_policy.run_invoker will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_iam_policy" "run_invoker" {
      + id          = (known after apply)
      + policy_data = (known after apply)

      + binding {
          + members = [
              + "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
            ]
          + role    = "roles/run.invoker"
        }
    }

  # module.secrets_leaks_log_scanner.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.secrets_leaks_log_scanner.data.google_secret_manager_secret.gh_tools_kyma_bot_token will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_secret_manager_secret" "gh_tools_kyma_bot_token" {
      + annotations           = (known after apply)
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + name                  = (known after apply)
      + replication           = (known after apply)
      + rotation              = (known after apply)
      + secret_id             = "trusted_default_kyma-bot-github-sap-token"
      + terraform_labels      = (known after apply)
      + topics                = (known after apply)
      + ttl                   = (known after apply)
      + version_aliases       = (known after apply)
      + version_destroy_ttl   = (known after apply)
    }

  # module.secrets_leaks_log_scanner.data.google_storage_bucket.kyma_prow_logs will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_storage_bucket" "kyma_prow_logs" {
      + autoclass                   = (known after apply)
      + cors                        = (known after apply)
      + custom_placement_config     = (known after apply)
      + default_event_based_hold    = (known after apply)
      + effective_labels            = (known after apply)
      + enable_object_retention     = (known after apply)
      + encryption                  = (known after apply)
      + force_destroy               = (known after apply)
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + lifecycle_rule              = (known after apply)
      + location                    = (known after apply)
      + logging                     = (known after apply)
      + name                        = "kyma-prow-logs"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + requester_pays              = (known after apply)
      + retention_policy            = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + soft_delete_policy          = (known after apply)
      + storage_class               = (known after apply)
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
      + versioning                  = (known after apply)
      + website                     = (known after apply)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.gcs_bucket_mover will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "gcs_bucket_mover" {
        id          = "v1/projects/sap-kyma-prow/locations/europe-west3/services/gcs-bucket-mover"
      ~ policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/run.invoker"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.github_issue_creator will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "github_issue_creator" {
        id          = "v1/projects/sap-kyma-prow/locations/europe-west3/services/github-issue-creator"
      ~ policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/run.invoker"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.github_issue_finder will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "github_issue_finder" {
        id          = "v1/projects/sap-kyma-prow/locations/europe-west3/services/github-issue-finder"
      ~ policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/run.invoker"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.secrets_leak_log_scanner will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "secrets_leak_log_scanner" {
        id          = "v1/projects/sap-kyma-prow/locations/europe-west3/services/secrets-leak-log-scanner"
      ~ policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/run.invoker"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_project_iam_member.project_log_writer must be replaced
-/+ resource "google_project_iam_member" "project_log_writer" {
      ~ etag    = "BwYdmGHk6Mk=" -> (known after apply)
      ~ id      = "projects/sap-kyma-prow/roles/logging.logWriter/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com" -> (known after apply)
      ~ project = "projects/sap-kyma-prow" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_project_iam_member.project_workflows_invoker must be replaced
-/+ resource "google_project_iam_member" "project_workflows_invoker" {
      ~ etag    = "BwYdmGHk6Mk=" -> (known after apply)
      ~ id      = "projects/sap-kyma-prow/roles/workflows.invoker/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com" -> (known after apply)
      ~ project = "projects/sap-kyma-prow" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_service_account.gcs_bucket_mover will be updated in-place
  ~ resource "google_service_account" "gcs_bucket_mover" {
      - display_name = "gcs-bucket-mover" -> null
        id           = "projects/sap-kyma-prow/serviceAccounts/gcs-bucket-mover@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/gcs-bucket-mover@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_service_account.github_issue_creator will be updated in-place
  ~ resource "google_service_account" "github_issue_creator" {
      - display_name = "github-issue-creator" -> null
        id           = "projects/sap-kyma-prow/serviceAccounts/github-issue-creator@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/github-issue-creator@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_service_account.github_issue_finder will be updated in-place
  ~ resource "google_service_account" "github_issue_finder" {
      - display_name = "github-issue-finder" -> null
        id           = "projects/sap-kyma-prow/serviceAccounts/github-issue-finder@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/github-issue-finder@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_service_account.secrets_leak_detector will be updated in-place
  ~ resource "google_service_account" "secrets_leak_detector" {
      - display_name = "secrets-leak-detector" -> null
        id           = "projects/sap-kyma-prow/serviceAccounts/secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_service_account.secrets_leak_log_scanner will be updated in-place
  ~ resource "google_service_account" "secrets_leak_log_scanner" {
      - display_name = "secrets-leak-log-scanner" -> null
        id           = "projects/sap-kyma-prow/serviceAccounts/secrets-leak-log-scanner@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/secrets-leak-log-scanner@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.service_account_keys_cleaner.google_service_account.service_account_keys_cleaner will be updated in-place
  ~ resource "google_service_account" "service_account_keys_cleaner" {
      - display_name = "sa-keys-cleaner" -> null
        id           = "projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.service_account_keys_rotator.google_service_account.service_account_keys_rotator will be updated in-place
  ~ resource "google_service_account" "service_account_keys_rotator" {
      - display_name = "sa-keys-rotator" -> null
        id           = "projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.slack_message_sender.data.google_iam_policy.run_invoker will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_iam_policy" "run_invoker" {
      + id          = (known after apply)
      + policy_data = (known after apply)

      + binding {
          + members = [
              + "serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com",
            ]
          + role    = "roles/run.invoker"
        }
    }

  # module.slack_message_sender.google_cloud_run_service_iam_policy.slack_message_sender will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "slack_message_sender" {
        id          = "v1/projects/sap-kyma-prow/locations/europe-west3/services/slack-message-sender"
      ~ policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/run.invoker"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.slack_message_sender.google_service_account.slack_message_sender will be updated in-place
  ~ resource "google_service_account" "slack_message_sender" {
      - display_name = "slack-message-sender" -> null
        id           = "projects/sap-kyma-prow/serviceAccounts/slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

Plan: 38 to add, 18 to change, 2 to destroy.

Changes to Outputs:
  ~ secrets-rotator                                     = {
      ~ create_ignore_already_exists = null -> true
        id                           = "projects/sap-kyma-prow/serviceAccounts/secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com"
        name                         = "projects/sap-kyma-prow/serviceAccounts/secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com"
        # (9 unchanged attributes hidden)
    }
  ~ service_account_keys_cleaner                        = {
      ~ service_account_keys_cleaner_service_account   = {
          ~ display_name                 = "" -> null
            id                           = "projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com"
            name                         = "projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com"
            # (9 unchanged attributes hidden)
        }
        # (2 unchanged attributes hidden)
    }
  ~ service_account_keys_rotator                        = {
      ~ service_account_keys_rotator_service_account     = {
          ~ display_name                 = "" -> null
            id                           = "projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com"
            name                         = "projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com"
            # (9 unchanged attributes hidden)
        }
        # (3 unchanged attributes hidden)
    }
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.service_account_keys_cleaner.google_service_account.service_account_keys_cleaner has changed
  ~ resource "google_service_account" "service_account_keys_cleaner" {
      + display_name = "sa-keys-cleaner"
        id           = "projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.service_account_keys_rotator.google_service_account.service_account_keys_rotator has changed
  ~ resource "google_service_account" "service_account_keys_rotator" {
      + display_name = "sa-keys-rotator"
        id           = "projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>







<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":11401,"Program":"tfcmt","SHA1":"1b83e5091673f5d636f48b364b8c1e7cfe3db72b","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->